
cask "cursor"
cask "alacritty"
cask "tmux"
cask "docker"
cask "brave-browser"
cask "google-japanese-ime"
cask "raycast"
cask "rectangle"
cask "karabiner-elements"
cask "slack"
cask "notion"
cask "microsoft-teams"
cask "zoom"

brew "git"
brew "stow"
brew "neovim"
brew "ripgrep"
brew "eza"
