
brew "git"
brew "stow"      # dotfiles管理用
brew "neovim"
brew "ripgrep"   # 高速なgrepツール
brew "eza"       # lsコマンドのモダンな代替
brew "htop"      # プロセスモニタリング
brew "tldr"      # コマンドの簡単な説明
brew "bat"       # catコマンドのモダンな代替
brew "fd"        # findコマンドのモダンな代替
brew "fzf"       # ファイル検索
brew "zoxide"    # ディレクトリの移動
brew "tmux"      # ターミナルマルチプレクサ
brew "timg"      # Kittyグラフィックスプロトコル対応画像表示
brew "chafa"     # テキストベース画像表示（fzfプレビュー用）
brew "imagemagick" # 画像処理（molten-nvim用）
brew "luajit"      # Lua JITコンパイラ（image.nvim用）
brew "ghostscript"  # ImageMagickのPDF/フォント処理に必要

cask "cursor"
cask "ghostty"
cask "font-hackgen-nerd"
cask "font-zen-maru-gothic"
cask "docker"
cask "brave-browser"
cask "raycast"
cask "rectangle"
cask "karabiner-elements"
cask "slack"
cask "notion"
cask "microsoft-teams"
cask "zoom"
cask "obsidian"
